#ifndef  _DZXH_STM32_EXTI_H_
#define  _DZXH_STM32_EXTI_H_

#include "stm32f10x.h"
/*==================================================================================
    NVIC_PriorityGroup   |  主优先级范围  |  次优先级范围  |   描述
  ==================================================================================
   NVIC_PriorityGroup_0  |      0         |      0-15      |   0 比特表示主优先级
                         |                |                |   4 比特表示次优先级 
  ----------------------------------------------------------------------------------
   NVIC_PriorityGroup_1  |      0-1       |      0-7       |   1 比特表示主优先级
                         |                |                |   3 比特表示次优先级 
  ----------------------------------------------------------------------------------
   NVIC_PriorityGroup_2  |      0-3       |      0-3       |   2 比特表示主优先级
                         |                |                |   2 比特表示次优先级 
  ----------------------------------------------------------------------------------
   NVIC_PriorityGroup_3  |      0-7       |      0-1       |   3 比特表示主优先级
                         |                |                |   1 比特表示次优先级 
  ----------------------------------------------------------------------------------
   NVIC_PriorityGroup_4  |      0-15      |      0         |   4 比特表示主优先级
                         |                |                |   0 比特表示次优先级   
  ==================================================================================*/
void EXTIX_Init(u8 GPIOx,u8 GPIO_PIN,EXTITrigger_TypeDef  EXTI_Mode,uint8_t PreemptionPriority,uint8_t SubPriority);
#endif
